<?php

namespace Database\Seeders;

use App\Models\Category;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CategoryTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            "लागु पदार्थको दुरुपयोग",
            "प्राकृतिक श्रोत दोहन",
            "भन्सार/राजस्व छली",
            "वैकल्पिक फारम",
            "खानेपानी सम्बन्धित गुनासो",
            "प्राकृतिक श्रोतको अतिक्रमण",
            "फुटपाथ/ जेब्राक्रस नभएको",
            "लागु औषध ओसारपोसार",
            "स्वास्थ्य चौकी/अस्पतालसंग सम्बन्धी",
            "महामारी फैलिएको",
            "प्रयोगशालामा आवश्यक उपकरणको अभाव",
            "कार्यालय परिसरमा सफाईको कमी",
            "कर्मचारीहरूले कार्यालय पोसाक नलगाएको",
            "सरकारी सवारी साधनको दुरुपयोग",
            "सार्वजनिक निर्माणमा सम्बन्धी",
            "निर्माणकार्यमा अनियमितता",
            "घुस/रिसवत लेनदेन",
            "अस्पताल/स्वास्थ्य चौकीमा अनियमितता",
            "खरिदमा अनियमितता",
            "वेबसाइटमा समस्या",
            "कर्मचारी अभाव",
            "पर्किङ्ग  सम्बन्धि गुनासो",
            "कार्यालय अभिलेख/रेकर्ड सम्बन्धि गुनासो",
            "कर्मचारी माथिको भेदभाव",
            "नागरिक वडापत्र सम्बन्धि गुनासो",
            "हत्या/हिंसा",
            "कुटपिट",
            "चोरी/डकैती",
            "दोहोरो नागरिकता",
            "बिदेशीलाई  नेपाली नागरिकता जारी भएको",
            "झुटा विवरण पेश गरि नागरिकता लिएको",
            "नागरिकता नदिएको",
            "गैर कानुनी धर्म प्रचार",
            "गैर सरकारी संस्थाको अनियमितता",
            "सार्वजनिक जग्गा अतिक्रमण",
            "सार्वजनिक भवन / संरचना अतिक्रमण",
            "प्रभावित व्यक्ति/परिवारले क्षेतिपूर्ति नपाएको",
            "धम्कि/असूली धन्दा",
            "मानव तस्करी",
            "ठगी/किर्ते/जालसाजी",
            "कारागारमा हुने अनियमितता र बन्दीमाथि हुने दुर्व्यवहार",
            "कर्मचारीको अनुसासन/आचरण",
            "कालोबजारी",
            "गुणस्तरहिन बस्तुको बिक्री",
            "सामाजिक संजालको दुरुपयोग",
            "प्राकृतिक विपद्",
            "गैरप्राकृतिक विपद्",
            "विपद्को समयमा हुने उद्दारमा अनियमितता",
            "खेलकुदमा देखिएका समस्याहरु",
            "ट्राफिक प्रहरी सम्बन्धि गुनासो",
            "युवा खेलकुद सम्बन्धी",
            "सामुदायिक विद्यालय  सम्बन्धी गुनासो",
            "जग्गा जमिन सम्बन्धि गुनासो",
            "स्थानीय तह सम्बन्धी गुनासो",
            "निजी विद्यालयसँग सम्बन्धीत गुनासो",
            "विश्वविद्यालयसँग संबन्धित गुनासो",
            "शैक्षिक परामर्श दाता संस्था सम्बन्धित गुनासो",
            "लाइसेन्समा अनियमितता",
            "सडक पुलसंग सम्बन्धित गुनासो",
            "ढल व्यवस्थापन सम्बन्धी गुनासो",
            "तरकारी उत्पादनमा विषादी प्रयोग भएको",
            "कृषि अनुदानमा अनियमितता सम्बन्धमा",
            "कृषिबालि नष्ट भएको सम्बन्धमा",
            "छाडा चौपाया सम्बन्धि गुनासो",
            "महिला,बालबालिका तथा जेष्ठ नागरिकसँग सम्बन्धित गुनासा",
            "कार्यालयको सूचना व्यवस्थापन",
            "उर्जा, सिचाई तथा जलश्रोतका समस्या सम्बन्धमा",
            "संस्कृती, पर्यटन तथा नागरिक उड्डयनसंग सम्बन्धित गुनासो",
            "स्वास्थ्य सेवा वितरण प्रभावकारी नभएको",
            "यातायातका साधनको बिषयमा गरिने गुनासो",
            "सङ्घीय मामिला तथा सा.प्र सम्बन्धीत समस्या",
            "फोहोर व्यवस्थापन  नभएको",
            "टेलिकम संग सम्बन्धित  गुनासो",
            "उधोगसंग सम्बन्धित गुनासो",
            "बाणिज्यसंग सम्बन्धित गुनासो",
            "यातायात व्यवस्था कार्यालयसंग सम्बन्धित गुनासो",
            "आपूर्तिसंग सम्बन्धित गुनासो",
            "कर्मचारीसंग सम्बन्धित गुनासो",
            "कर छलीसंग सम्बन्धित गुनासो",
            "शूल्क, दस्तुर र जरीवानासंग सम्बन्धित गुनासो",
            "कानून, न्याय तथा संसदीय मामिलासंग सम्बन्धित गुनासो",
            "बैंक/वित्तीय संस्था तथा सहकारीसंग सम्बन्धित गुनासो",
            "श्रम रोजगार तथा सामाजिक सुरक्षासंग सम्बन्धित गुनासो",
            "परराष्ट्रसंग सम्बन्धित गुनासो",
            "पशुपंछी पालन समन्धमा",
            "सिमा सुरक्षा सम्बन्धि",
            "वन्नेजन्तु सम्बन्धि",
            "वन सम्बन्धि",
            "वातावरण सम्बन्धि",
            "जडीबुटी सम्बन्धि गुनासो",
            "लोक सेवा आयोग सम्बन्धि",
            "रेडियो तथा टेलिभिजन सम्बन्धि",
            "अनलाइन पत्रपत्रिका सम्बन्धि गुनासो",
            "पत्रपत्रिका सम्बन्धि",
            "उपभोक्ता समिति सम्बन्धि",
            "बैदेशिक रोजगार सम्बन्धि गुनासो",
            "सडकपेटी/ फुटपाथमा आवतजावत गर्न समस्या",
            "मदिरा तथा सुर्तीजन्य पदार्थ सम्बन्धि",
            "गुठी सम्बन्धी",
            "पर्यटकसंग सम्बन्धित"
        ];

        foreach ($data as $datum)
        {
            $category = new Category();
            $category->name = $datum;
            $category->save();
        }
    }
}
