<?php

namespace Database\Seeders;

use App\Models\Department;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class DepartmentTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            ["GA1","आन्तरिक प्रशासन तथा जनशक्ति विकास शाखा"],
            ["GA2","सम्पत्ति व्यवस्थापन तथा खरिद शाखा"],
            ["GA3","सुशासन तथा कानुन शाखा"],
            ["GA4","राजश्व प्रशासन शाखा"],
            ["SD1","आयुर्वेद तथा जनस्वास्थ्य प्रवर्धन शाखा"],
            ["SD2","सामाजिक सुरक्षा तथा पञ्चिकरण शाखा"],
            ["SD3","विपद् प्रतिकार्य, फोहरमैला व्यवस्थापन तथा वातावरण शाखा"],
            ["SD4","यूवा, खेलकुद, संस्कृति तथा समाज कल्याण शाखा"],
            ["ED1","कृषि विकास शाखा"],
            ["ED2","पशुपन्छी विकास शाखा"],
            ["ED3","उ्दयोग, पर्यटन, रोजगार तथा सहकारी प्रवर्द्धन शाखा"],
            ["UID1","योजना कार्यान्वयन तथा सार्वजनिक निर्माण शाखा"],
            ["UID2","भवन अनुमति तथा मापदण्ड कार्यन्वयन शाखा"],
            ["UID3","घर नक्सा निःशुल्क निर्माण सहायता शाखा"],
            ["EA1","आर्थिक प्रशासन शाखा"],
            ["EA2","पेश्कि, बेरुजु फर्छ्यौट तथा आर्थिक सुशासन शाखा"],
            ["PIBD1","योजना तथा बजेट शाखा"],
            ["PIBD2","अनुगमन तथा मुल्याङ्कन शाखा"],
            ["PIBD3","सूचना तथा संचार प्रविधि शाखा"],
            ["EDU1","प्ररम्भिक बालबिकास तथा आधारभूत शिक्षा शाखा"],
            ["EDU2","माध्यमिक शिक्षा शाखा"],
            ["WAC1","महिला तथा बालबालिका शाखा"],

        ];

        foreach ($data as $datum)
        {
            $department = new Department();
            $department->identifier = $datum[0];
            $department->name = $datum[1];
            $department->save();
        }
    }
}
